saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.S32_SDK_DFP.1.2.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>S32_SDK_DFP</name>
  <description>NXP S32 SDK including S32K144HFT0VLLT, S32K144LFT0MLLT basic CMSIS Device Support</description>
  <url>http://www.keil.com/pack/</url>

  <releases>
    <release version="1.2.0" date="2018-01-16">
      Added S32K146 device support.
      Added DFlash Algorithm for SK148 device.
      Reworked examples.
    </release>
    <release version="1.1.0" date="2017-09-19">
      NOTE: Only linking with scatter/linker-descripton files supported!
      Only copy linker scatter files for selected ARM Compiler Version 5 vs. 6
      Updated S32_SDK.
      Added S32K142, S32K148 device support.
      Added S32K148-EVB board support.
      Updated ETM trace example.
      Updated ADC board support files.
    </release>
    <release version="1.0.0" date="2017-04-19">
      Initial version of NXP S32 Device Family Pack
      - based on the NXP Software Development Kit for S32 Version 1.0.0.
      - renamed *.SCF files to *.SCT (Scatter Files for ARM Linker).
      - example project for S32K144-EVB FRDM Board
      - patched device include file (CMSIS also for ARMCC, GCC, IAR).
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>S32</keyword>
  </keywords>

  <devices>
    <family Dfamily="S32K Series" Dvendor="NXP:11">
      <description>
The NXP S32K product series of 32-bit automotive microcontrollers provides a highly integrated, low-power, safe and secure single-chip solution.
The combination of fast CPU with flexible low-power modes and the low-leakage technology process will not force any compromises on performance relative to low-power.
Our combined Cortex® M0+ and M4-based automotive MCU offerings span a broad memory space and include package options from 8 K to 2 MByte with 16 to 176 pins initially.
The ARM® Cortex M4 core architecture includes an IEEE-754 compliant single precision Floating Point Unit (FPU) with DSP functions unleashing the full potential of model-based design flows.
      </description>

      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>

      <!-- ******************************  Subfamily 'S32K14x'  ****************************** -->
      <subFamily DsubFamily="S32K14x">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="FPU" Dmpu="MPU" Dendian="Little-endian"/>

        <book name="addon_mdk/Documents/DUI0553A_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <book name="addon_mdk/Documents/S32K-RM.pdf"                 title="S32K1xx Series Reference Manual"/>
        <book name="addon_mdk/Documents/S32K-DS.pdf"                 title="S32K1xx Data Sheet"/>

        <!-- ******************************  Device 'S32K142'  ****************************** -->
        <device Dname="S32K142">
          <compile header="platform/devices/device_registers.h"/> <!-- generates warning in PackCheck because name is not CMSIS conform -->
          <compile define="CPU_S32K142"/>
          <debug  svd="platform/devices/S32K142/S32K142.svd"/>
          <memory id="IROM1"                                           start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <algorithm name="addon_cmsis/Flash/S32K142_P256_2KB_SEC.FLM" start="0x00000000" size="0x00040000" default="1"/>

          <!-- *********************** -->
          <!-- 64MHz 64LQFP -->
          <variant Dvariant="S32K142MRxxxLHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K142MFxxxLHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K142MSxxxLHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K142MAxxxLHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>

          <!-- 80MHz 64LQFP -->
          <variant Dvariant="S32K142HRxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K142HFxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K142HSxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K142HAxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>

          <!-- 112MHz 64LQFP -->
          <variant Dvariant="S32K142URxxxLHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K142UFxxxLHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K142USxxxLHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K142UAxxxLHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>

          <!-- *********************** -->
          <!-- 64MHz 100LQFP -->
          <variant Dvariant="S32K142MRxxxLLx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K142MFxxxLLx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K142MSxxxLLx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K142MAxxxLLx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>

          <!-- 80MHz 100LQFP -->
          <variant Dvariant="S32K142HRxxxLLx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K142HFxxxLLx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K142HSxxxLLx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K142HAxxxLLx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>

          <!-- 112MHz 100LQFP -->
          <variant Dvariant="S32K142URxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K142UFxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K142USxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K142UAxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
        </device>

        <!-- ******************************  Device 'S32K144'  ****************************** -->
        <device Dname="S32K144">
          <compile header="platform/devices/device_registers.h"/> <!-- generates warning in PackCheck because name is not CMSIS conform -->
          <compile define="CPU_S32K144HFT0VLLT"/>
          <debug  svd="platform/devices/S32K144/S32K144.svd"/>
          <memory id="IROM1"                                           start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <algorithm name="addon_cmsis/Flash/S32K144_P512_4KB_SEC.FLM" start="0x00000000" size="0x00080000" default="1"/>

          <!-- *********************** -->
          <!-- 64MHz 64LQFP -->
          <variant Dvariant="S32K144MNxxxLHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF9000" size="0x00007000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K144MRxxxLHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K144MFxxxLHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K144MSxxxLHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K144MAxxxLHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>

          <!-- 80MHz 64LQFP -->
          <variant Dvariant="S32K144HNxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF9000" size="0x00007000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K144HRxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K144HFxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K144HSxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K144HAxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>

          <!-- 112MHz 64LQFP -->
          <variant Dvariant="S32K144UNxxxLHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF9000" size="0x00007000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K144URxxxLHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K144UFxxxLHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K144USxxxLHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K144UAxxxLHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>

          <!-- *********************** -->
          <!-- 64MHz 100LQFP -->
          <variant Dvariant="S32K144MNxxxLLx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF9000" size="0x00007000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144MRxxxLLx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144MFxxxLLx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144MSxxxLLx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144MAxxxLLx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>

          <!-- 80MHz 100LQFP -->
          <variant Dvariant="S32K144HNxxxLLx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF9000" size="0x00007000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144HRxxxLLx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144HFxxxLLx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144HSxxxLLx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144HAxxxLLx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>

          <!-- 112MHz 100LQFP -->
          <variant Dvariant="S32K144UNxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF9000" size="0x00007000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144URxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144UFxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144USxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144UAxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>

