saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.S32_SDK_DFP.1.2.0.pdsc
          <!-- *********************** -->
          <!-- 64MHz 100MAPBGA -->
          <variant Dvariant="S32K144MNxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF9000" size="0x00007000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144MRxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144MFxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144MSxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144MAxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>

          <!-- 80MHz 100MAPBGA -->
          <variant Dvariant="S32K144HNxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF9000" size="0x00007000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144HRxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144HFxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144HSxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144HAxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>

          <!-- 112MHz 100MAPBGA -->
          <variant Dvariant="S32K144UNxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF9000" size="0x00007000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144URxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144UFxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144USxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144UAxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
        </device>

        <!-- ******************************  Device 'S32K146'  ****************************** -->
        <device Dname="S32K146">
          <compile header="platform/devices/device_registers.h"/> <!-- generates warning in PackCheck because name is not CMSIS conform -->
          <compile define="CPU_S32K146"/>
          <debug  svd="platform/devices/S32K146/S32K146.svd"/>
          <memory id="IROM1"                                            start="0x00000000" size="0x00100000" default="1" startup="1"/>
          <algorithm name="addon_cmsis/Flash/S32K146_P1024_4KB_SEC.FLM" start="0x00000000" size="0x00100000" default="1"/>

          <!-- *********************** -->
          <!-- 64MHz 64LQFP -->
          <variant Dvariant="S32K146MNxxxLHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K146MRxxxLHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K146MFxxxLHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K146MSxxxLHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K146MAxxxLHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>

          <!-- 80MHz 64LQFP -->
          <variant Dvariant="S32K146HNxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K146HRxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K146HFxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K146HSxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K146HAxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>

          <!-- 112MHz 64LQFP -->
          <variant Dvariant="S32K146UNxxxLHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K146URxxxLHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K146UFxxxLHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K146USxxxLHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K146UAxxxLHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>

          <!-- *********************** -->
          <!-- 64MHz 100LQFP -->
          <variant Dvariant="S32K146MNxxxLLx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K146MRxxxLLx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K146MFxxxLLx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K146MSxxxLLx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K146MAxxxLLx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>

          <!-- 80MHz 100LQFP -->
          <variant Dvariant="S32K146HNxxxLLx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K146HRxxxLLx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K146HFxxxLLx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K146HSxxxLLx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K146HAxxxLLx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>

          <!-- 112MHz 100LQFP -->
          <variant Dvariant="S32K146UNxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K146URxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K146UFxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K146USxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K146UAxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>

          <!-- *********************** -->
          <!-- 64MHz 144LQFP -->
          <variant Dvariant="S32K146MNxxxLQx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K146MRxxxLQx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K146MFxxxLQx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K146MSxxxLQx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K146MAxxxLQx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>

          <!-- 80MHz 144LQFP -->
          <variant Dvariant="S32K146HNxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K146HRxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K146HFxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K146HSxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K146HAxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>

