saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.S32_SDK_DFP.1.2.0.pdsc
        <!-- ******************************  Device 'S32K148'  ****************************** -->
        <device Dname="S32K148">
          <compile header="platform/devices/device_registers.h"/> <!-- generates warning in PackCheck because name is not CMSIS conform -->
          <compile define="CPU_S32K148"/>
          <debug  svd="platform/devices/S32K148/S32K148.svd"/>
          <memory id="IROM1"                                            start="0x00000000" size="0x00180000" default="1" startup="1"/>
          <memory id="IROM2"                                            start="0x10000000" size="0x00080000" default="0" startup="1"/>
          <algorithm name="addon_cmsis/Flash/S32K148_P1536_4KB_SEC.FLM" start="0x00000000" size="0x00180000" default="1"/>
          <algorithm name="addon_cmsis/Flash/S32K148_D512_4KB_SEC.FLM"  start="0x10000000" size="0x00080000" default="0"/>

          <!-- *********************** -->
          <!-- 80MHz 144LQFP -->
          <variant Dvariant="S32K148HNxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00017000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE8000" size="0x00018000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148HRxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148HFxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148HSxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148HAxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148HExxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148HJxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>

          <!-- 112MHz 144LQFP -->
          <variant Dvariant="S32K148UNxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00017000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE8000" size="0x00018000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148URxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148UFxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148USxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148UAxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148UExxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148UJxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>

          <!-- *********************** -->
          <!-- 80MHz 176LQFP -->
          <variant Dvariant="S32K148HNxxxLUx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00017000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE8000" size="0x00018000" init   ="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148HRxxxLUx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148HFxxxLUx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148HSxxxLUx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148HAxxxLUx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148HExxxLUx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148HJxxxLUx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>

          <!-- 112MHz 176LQFP -->
          <variant Dvariant="S32K148UNxxxLUx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00017000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE8000" size="0x00018000" init   ="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148URxxxLUx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148UFxxxLUx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148USxxxLUx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148UAxxxLUx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148UExxxLUx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148UJxxxLUx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>


          <!-- *********************** -->
          <!-- 80MHz 100MAPBGA -->
          <variant Dvariant="S32K148HNxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00017000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE8000" size="0x00018000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148HRxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148HFxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148HSxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148HAxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148HExxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148HJxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>

          <!-- 112MHz 100MAPBGA -->
          <variant Dvariant="S32K148UNxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00017000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE8000" size="0x00018000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148URxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148UFxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148USxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148UAxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148UExxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148UJxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init   ="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
        </device>

      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- one condition for each device -->
    <condition id="S32K142">
      <description>NXP S32K142 device</description>
      <accept Dvendor="NXP:11" Dname="S32K142*"/>
    </condition>
    <condition id="S32K142_32">
      <description>NXP S32K142 device with 32K RAM</description>
      <accept Dvendor="NXP:11" Dname="S32K142[MHU][RFSA]*"/>
    </condition>

