saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.S32_SDK_DFP.1.2.0.pdsc
    <condition id="S32K144">
      <description>NXP S32K144 device</description>
      <accept Dvendor="NXP:11" Dname="S32K144*"/>
    </condition>
    <condition id="S32K144_48">
      <description>NXP S32K144 device with 48K RAM</description>
      <accept Dvendor="NXP:11" Dname="S32K144[MHU]N*"/>
    </condition>
    <condition id="S32K144_64">
      <description>NXP S32K144 device with 64K RAM</description>
      <accept Dvendor="NXP:11" Dname="S32K144[MHU][RFSA]*"/>
    </condition>

    <condition id="S32K146">
      <description>NXP S32K146 device</description>
      <accept Dvendor="NXP:11" Dname="S32K146*"/>
    </condition>
    <condition id="S32K146_128">
      <description>NXP S32K146 device with 128K RAM</description>
      <accept Dvendor="NXP:11" Dname="S32K146[MHU][NRFSA]*"/>
    </condition>

    <condition id="S32K148">
      <description>NXP S32K148 device</description>
      <accept Dvendor="NXP:11" Dname="S32K148*"/>
    </condition>
    <condition id="S32K148_192">
      <description>NXP S32K144 device with 192K RAM</description>
      <accept Dvendor="NXP:11" Dname="S32K148[MHU]N*"/>
    </condition>
    <condition id="S32K148_256">
      <description>NXP S32K144 device with 256K RAM</description>
      <accept Dvendor="NXP:11" Dname="S32K148[MHU][RFSAEJ]*"/>
    </condition>

    <!-- one condition for each device group with same coreclock/Startup -->
    <condition id="S32K14x">
      <description>NXP S32K14x devices</description>
      <accept condition="S32K142"/>
      <accept condition="S32K144"/>
      <accept condition="S32K146"/>
      <accept condition="S32K148"/>
      <!--accept condition="next device with same coreclock"/-->
    </condition>

    <!-- one condition for device subfamily + CMSIS -->
    <condition id="S32K14x_CMSIS">
      <description>NXP S32K14x devices and CMSIS-CORE</description>
      <accept condition="S32K14x"/>
       <!--accept condition="next devices group within same subfamily"/-->
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- one condition for all devices in this pack -->
    <condition id="S32K">
      <description>NXP S32K device and CMSIS-CORE</description>
      <accept condition="S32K14x_CMSIS"/>
      <!--accept condition="next subfamily"/-->
    </condition>

    <!--condition id="S32K Unknown">
      <description>NXP S32K unknown device and CMSIS-CORE</description>
      <require Dvendor="NXP:11" Dname="S32Kxxx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition-->

    <condition id="S32K_ARMCC_AC5">
      <description>NXP S32K and the ARM compiler</description>
      <require condition="S32K"/>
      <require Tcompiler="ARMCC" Toptions="AC5"/>
    </condition>
    <condition id="S32K_ARMCC_AC6">
      <description>NXP S32K and the ARM compiler</description>
      <require condition="S32K"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>
    <condition id="S32K_GCC">
      <description>NXP S32K and the GCC compiler</description>
      <require condition="S32K"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="S32K_IAR">
      <description>NXP S32K and the IAR compiler</description>
      <require condition="S32K"/>
      <require Tcompiler="IAR"/>
    </condition>

    <!-- bundle dependencies -->
    <condition id="S32K144 DRV_CLOCK_PINS">
      <description>NXP S32K Driver Clock Pins dependency</description>
      <require condition="S32K144"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="PINS"/>
    </condition>
    <condition id="S32K144 DRV_CLOCK_PINS_ADC">
      <description>NXP S32K Driver Clock Pins ADC dependency</description>
      <require condition="S32K144"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="PINS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="ADC"/>
    </condition>
    <condition id="S32K148 DRV_CLOCK_PINS">
      <description>NXP S32K Driver Clock Pins dependency</description>
      <require condition="S32K148"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="PINS"/>
    </condition>
    <condition id="S32K148 DRV_CLOCK_PINS_ADC">
      <description>NXP S32K Driver Clock Pins ADC dependency</description>
      <require condition="S32K148"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="PINS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="ADC"/>
    </condition>

    <condition id="S32K DRV_ADC">
      <description>NXP S32K Driver ADC dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_Clock">
      <description>NXP S32K System Clock dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K DRV_CMP">
      <description>NXP S32K Driver CMP dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_CRC">
      <description>NXP S32K Driver CRC dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_CSEC">
      <description>NXP S32K Driver CSEC dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K DRV_EDMA">
      <description>NXP S32K Driver eDMA dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K DRV_EIM">
      <description>NXP S32K Driver EIM dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K148 DRV_ENET">
      <description>NXP S32K Driver ENET dependency</description>
      <require condition="S32K148"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K DRV_ERM">
      <description>NXP S32K Driver ERM dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_EWM">
      <description>NXP S32K Driver EWM dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K DRV_FLASH_MX25">
      <description>NXP S32K Driver FLASH MX25l6433F dependency</description>
      <require condition="S32K148"/>
      <!--require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/-->
      <require Cclass="Device" Cgroup="SDK Driver" Csub="QSPI"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K DRV_FTM">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K DRV_FTM_IC">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
    <condition id="S32K DRV_FTM_MC">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
    <condition id="S32K DRV_FTM_OC">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
    <condition id="S32K DRV_FTM_PWM">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
