saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.S32_SDK_DFP.1.2.0.pdsc
    <condition id="S32K DRV_FTM_QD">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
    <condition id="S32K DRV_FlexCAN">
      <description>NXP S32K Driver FlexCAN dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K DRV_FlexIO">
      <description>NXP S32K Driver FLEXIO dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K DRV_FlexIO_I2C">
      <description>NXP S32K Driver FLEXIO I2C dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="S32K DRV_FlexIO_I2S">
      <description>NXP S32K Driver FLEXIO I2S dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="S32K DRV_FlexIO_SPI">
      <description>NXP S32K Driver FLEXIO SPI dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="S32K DRV_FlexIO_UART">
      <description>NXP S32K Driver FLEXIO UART dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="S32K DRV_LIN">
      <description>NXP S32K Driver LIN dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="LPUART"/>
    </condition>
    <condition id="S32K DRV_LPI2C">
      <description>NXP S32K Driver LPI2C dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K DRV_LPIT">
      <description>NXP S32K Driver LPIT dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K DRV_LPSPI">
      <description>NXP S32K Driver LPSPI dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K DRV_LPTMR">
      <description>NXP S32K Driver LPTMR dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
    </condition>
    <condition id="S32K DRV_LPUART">
      <description>NXP S32K Driver LPUART IRQ dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K DRV_MPU">
      <description>NXP S32K Driver MPU dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_PDB">
      <description>NXP S32K Driver PDB dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
    </condition>
    <condition id="S32K DRV_PINS">
      <description>NXP S32K Driver PINS dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_Power">
      <description>NXP S32K System Power dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K148 DRV_QSPI">
      <description>NXP S32K Driver QSPI dependency</description>
      <require condition="S32K148"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K DRV_RTC">
      <description>NXP S32K Driver RTC dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K DRV_SAI">
      <description>NXP S32K Driver SAI dependency</description>
      <require condition="S32K148"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K DRV_TRGMUX">
      <description>NXP S32K Driver TRGMUX dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_WDOG">
      <description>NXP S32K Driver WDOG dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>

    <condition id="S32K PAL_SPI">
      <description>NXP S32K PAL SPI dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="LPSPI"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (SPI)"/>
    </condition>
    <condition id="S32K PAL_UART">
      <description>NXP S32K PAL UART dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="LPUART"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (UART)"/>
    </condition>


