saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.S32_SDK_DFP.1.2.0.pdsc
    <condition id="S32K OSIF_BM">
      <description>NXP S32K OSIF Bare Metal dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>

  </conditions>

  <taxonomy>
    <description Cclass="Device" Cgroup="SDK HAL">S32 SDK Hardware Abstraction Layer (HAL)</description>
    <description Cclass="Device" Cgroup="SDK Driver">S32 SDK Peripheral Drivers</description>
  </taxonomy>

  <apis>
    <api Cclass="Device" Cgroup="SDK API"               exclusive="1">
      <description>S32 SDK API</description>
      <files>
        <file category="doc" name="doc/S32_SDK_Documentation.pdf"/>
      </files>
    </api>
    <api Cclass="Device" Cgroup="SDK Quick Start Guide" exclusive="1">
      <description>S32 SDK Quick Start Guide</description>
      <files>
        <file category="doc" name="doc/S32SDKQSG.pdf"/>
      </files>
    </api>
  </apis>

  <components>
    <!-- Startup for toolchain ARMCC V5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="S32K_ARMCC_AC5">
      <description>System Startup for NXP S32K Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_S32K      /* Device Startup for S32K Series */
      </RTE_Components_h>
      <files>
        <!-- include folders -->
        <file category="header"  name="platform/devices/device_registers.h"/> <!-- generates warning in PackCheck because name is not CMSIS conform -->
        <file category="include" name="platform/devices/"/>
        <file category="include" name="platform/devices/common/"/>

        <!-- startup files -->
        <file category="source" name="platform/devices/startup.c"/>
        <file category="source" name="platform/devices/S32K142/startup/arm/startup_S32K142.s"              attr="config" version="1.0.0" condition="S32K142"/>
        <file category="source" name="platform/devices/S32K144/startup/arm/startup_S32K144.s"              attr="config" version="2.0.0" condition="S32K144"/>
        <file category="source" name="platform/devices/S32K146/startup/arm/startup_S32K146.s"              attr="config" version="1.0.0" condition="S32K146"/>
        <file category="source" name="platform/devices/S32K148/startup/arm/startup_S32K148.s"              attr="config" version="1.0.0" condition="S32K148"/>

        <!-- system files -->
        <file category="header" name="platform/devices/S32K142/startup/system_S32K142.h"                   attr="config" version="1.0.0" condition="S32K142"/>
        <file category="source" name="platform/devices/S32K142/startup/system_S32K142.c"                   attr="config" version="1.0.0" condition="S32K142"/>
        <file category="header" name="platform/devices/S32K144/startup/system_S32K144.h"                   attr="config" version="2.0.0" condition="S32K144"/>
        <file category="source" name="platform/devices/S32K144/startup/system_S32K144.c"                   attr="config" version="2.0.0" condition="S32K144"/>
        <file category="header" name="platform/devices/S32K146/startup/system_S32K146.h"                   attr="config" version="1.0.0" condition="S32K146"/>
        <file category="source" name="platform/devices/S32K146/startup/system_S32K146.c"                   attr="config" version="1.0.0" condition="S32K146"/>
        <file category="header" name="platform/devices/S32K148/startup/system_S32K148.h"                   attr="config" version="1.0.0" condition="S32K148"/>
        <file category="source" name="platform/devices/S32K148/startup/system_S32K148.c"                   attr="config" version="1.0.0" condition="S32K148"/>

        <!-- linker scripts -->  <!-- RAM linker scripts have the category "other": Files are copied but not treated automatically as linker scripts -->
        <file category="linkerScript" name="platform/devices/S32K142/linker/arm/S32K142_32_flash.sct"      attr="config" version="1.0.0" condition="S32K142_32"/>
        <file category="linkerScript" name="platform/devices/S32K142/linker/arm/S32K142_32_ram.sct"        attr="config" version="1.0.0" condition="S32K142_32"/>
        <file category="linkerScript" name="platform/devices/S32K144/linker/arm/S32K144_48_flash.sct"      attr="config" version="2.0.0" condition="S32K144_48"/>
        <file category="linkerScript" name="platform/devices/S32K144/linker/arm/S32K144_48_ram.sct"        attr="config" version="2.0.0" condition="S32K144_48"/>
        <file category="linkerScript" name="platform/devices/S32K144/linker/arm/S32K144_64_flash.sct"      attr="config" version="2.0.0" condition="S32K144_64"/>
        <file category="linkerScript" name="platform/devices/S32K144/linker/arm/S32K144_64_ram.sct"        attr="config" version="2.0.0" condition="S32K144_64"/>
        <file category="linkerScript" name="platform/devices/S32K146/linker/arm/S32K146_128_flash.sct"     attr="config" version="1.0.0" condition="S32K146_128"/>
        <file category="linkerScript" name="platform/devices/S32K146/linker/arm/S32K146_128_ram.sct"       attr="config" version="1.0.0" condition="S32K146_128"/>
        <file category="linkerScript" name="platform/devices/S32K148/linker/arm/S32K148_192_flash.sct"     attr="config" version="1.0.0" condition="S32K148_192"/>
        <file category="linkerScript" name="platform/devices/S32K148/linker/arm/S32K148_192_ram.sct"       attr="config" version="1.0.0" condition="S32K148_192"/>
        <file category="linkerScript" name="platform/devices/S32K148/linker/arm/S32K148_256_flash.sct"     attr="config" version="1.0.0" condition="S32K148_256"/>
        <file category="linkerScript" name="platform/devices/S32K148/linker/arm/S32K148_256_ram.sct"       attr="config" version="1.0.0" condition="S32K148_256"/>
      </files>
    </component>

