saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.S32_SDK_DFP.1.2.0.pdsc
    <!-- Startup for toolchain IAR -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="S32K_IAR">
      <description>System Startup for NXP S32K Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_S32K      /* Device Startup for S32K Series */
      </RTE_Components_h>
      <files>
        <!-- include folders -->
        <file category="header"  name="platform/devices/device_registers.h"/> <!-- generates warning in PackCheck because name is not CMSIS conform -->
        <file category="include" name="platform/devices/"/>
        <file category="include" name="platform/devices/common/"/>

        <!-- startup files -->
        <file category="source" name="platform/devices/startup.c"/>
        <file category="source" name="platform/devices/S32K142/startup/iar/startup_S32K142.s"              attr="config" version="1.0.0" condition="S32K142"/>
        <file category="source" name="platform/devices/S32K144/startup/iar/startup_S32K144.s"              attr="config" version="2.0.0" condition="S32K144"/>
        <file category="source" name="platform/devices/S32K146/startup/iar/startup_S32K146.s"              attr="config" version="1.0.0" condition="S32K146"/>
        <file category="source" name="platform/devices/S32K148/startup/iar/startup_S32K148.s"              attr="config" version="1.0.0" condition="S32K148"/>

        <!-- system files -->
        <file category="header" name="platform/devices/S32K142/startup/system_S32K142.h"                   attr="config" version="1.0.0" condition="S32K142"/>
        <file category="source" name="platform/devices/S32K142/startup/system_S32K142.c"                   attr="config" version="1.0.0" condition="S32K142"/>
        <file category="header" name="platform/devices/S32K144/startup/system_S32K144.h"                   attr="config" version="2.0.0" condition="S32K144"/>
        <file category="source" name="platform/devices/S32K144/startup/system_S32K144.c"                   attr="config" version="2.0.0" condition="S32K144"/>
        <file category="header" name="platform/devices/S32K146/startup/system_S32K146.h"                   attr="config" version="1.0.0" condition="S32K146"/>
        <file category="source" name="platform/devices/S32K146/startup/system_S32K146.c"                   attr="config" version="1.0.0" condition="S32K146"/>
        <file category="header" name="platform/devices/S32K148/startup/system_S32K148.h"                   attr="config" version="1.0.0" condition="S32K148"/>
        <file category="source" name="platform/devices/S32K148/startup/system_S32K148.c"                   attr="config" version="1.0.0" condition="S32K148"/>

        <!-- linker scripts -->  <!-- RAM linker scripts have the category "other": Files are copied but not treated automatically as linker scripts -->
        <file category="linkerScript" name="platform/devices/S32K142/linker/iar/S32K142_32_flash.icf"      attr="config" version="1.0.0" condition="S32K142_32"/>
        <file category="linkerScript" name="platform/devices/S32K142/linker/iar/S32K142_32_ram.icf"        attr="config" version="1.0.0" condition="S32K142_32"/>
        <file category="linkerScript" name="platform/devices/S32K144/linker/iar/S32K144_48_flash.icf"      attr="config" version="2.0.0" condition="S32K144_48"/>
        <file category="linkerScript" name="platform/devices/S32K144/linker/iar/S32K144_48_ram.icf"        attr="config" version="2.0.0" condition="S32K144_48"/>
        <file category="linkerScript" name="platform/devices/S32K144/linker/iar/S32K144_64_flash.icf"      attr="config" version="2.0.0" condition="S32K144_64"/>
        <file category="linkerScript" name="platform/devices/S32K144/linker/iar/S32K144_64_ram.icf"        attr="config" version="2.0.0" condition="S32K144_64"/>
        <file category="linkerScript" name="platform/devices/S32K146/linker/iar/S32K146_128_flash.icf"     attr="config" version="1.0.0" condition="S32K146_128"/>
        <file category="linkerScript" name="platform/devices/S32K146/linker/iar/S32K146_128_ram.icf"       attr="config" version="1.0.0" condition="S32K146_128"/>
        <file category="linkerScript" name="platform/devices/S32K148/linker/iar/S32K148_192_flash.icf"     attr="config" version="1.0.0" condition="S32K148_192"/>
        <file category="linkerScript" name="platform/devices/S32K148/linker/iar/S32K148_192_ram.icf"       attr="config" version="1.0.0" condition="S32K148_192"/>
        <file category="linkerScript" name="platform/devices/S32K148/linker/iar/S32K148_256_flash.icf"     attr="config" version="1.0.0" condition="S32K148_256"/>
        <file category="linkerScript" name="platform/devices/S32K148/linker/iar/S32K148_256_ram.icf"       attr="config" version="1.0.0" condition="S32K148_256"/>
      </files>
    </component>

    <!-- SDK PAL -->
    <component Cclass="Device" Cgroup="SDK PAL" Csub="UART"  Cversion="1.0.0" condition="S32K PAL_UART">
      <description>UART Peripheral Abstraction Layer (UART PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_UART
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__uart__pal.html"/>
        <file category="header" name="platform/pal/uart/inc/uart_pal.h"/>
        <file category="source" name="platform/pal/uart/src/uart_pal.c"/>

        <file category="header" name="platform/pal/uart/cfg/uart_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK PAL" Csub="SPI"   Cversion="1.0.0" condition="S32K PAL_SPI">
      <description>SPI Peripheral Abstraction Layer (SPI PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_SPI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__spi__pal.html"/>
        <file category="header" name="platform/pal/spi/inc/spi_pal.h"/>
        <file category="source" name="platform/pal/spi/src/spi_pal.c"/>

        <file category="header" name="platform/pal/spi/cfg/spi_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>


