saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.S32_SDK_DFP.1.2.0.pdsc
    <!-- SDK Driver -->
    <component Cclass="Device" Cgroup="SDK Driver" Csub="ADC"           Cversion="1.0.0" condition="S32K DRV_ADC">
      <description>ADC Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_ADC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__adc__driver.html"/>
        <file category="header" name="platform/drivers/inc/adc_driver.h"/>
        <file category="source" name="platform/drivers/src/adc/adc_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="Clock"         Cversion="1.0.0" condition="S32K DRV_Clock">
      <description>Clock Manager Driver (SK32K1xx)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CLOCK
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__clock__manager.html"/>
        <file category="header" name="platform/drivers/inc/clock_manager.h"/>
        <file category="source" name="platform/drivers/src/clock/clock_manager.c"/>
        <file category="header" name="platform/drivers/src/clock/S32K1xx/clock_S32K1xx.h"/>
        <file category="source" name="platform/drivers/src/clock/S32K1xx/clock_S32K1xx.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="CMP"           Cversion="1.0.0" condition="S32K DRV_CMP">
      <description>Comparator Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CMP
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__cmp__driver.html"/>
        <file category="header" name="platform/drivers/inc/cmp_driver.h"/>
        <file category="source" name="platform/drivers/src/cmp/cmp_driver.c"/>
        <file category="source" name="platform/drivers/src/cmp/cmp_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="CRC"           Cversion="1.0.0" condition="S32K DRV_CRC">
      <description>CRC Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CRC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__crc__driver.html"/>
        <file category="header" name="platform/drivers/inc/crc_driver.h"/>
        <file category="source" name="platform/drivers/src/crc/crc_driver.c"/>
        <file category="source" name="platform/drivers/src/crc/crc_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="CSEC"          Cversion="1.0.0" condition="S32K DRV_CSEC">
      <description>CSEc Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CSEC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__csec__driver.html"/>
        <file category="header" name="platform/drivers/inc/csec_driver.h"/>
        <file category="source" name="platform/drivers/src/csec/csec_driver.c"/>
        <file category="source" name="platform/drivers/src/csec/csec_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"          Cversion="1.0.0" condition="S32K DRV_EDMA">
      <description>eDMA Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_EDMA
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__edma__driver.html"/>
        <file category="header" name="platform/drivers/inc/edma_driver.h"/>
        <file category="source" name="platform/drivers/src/edma/edma_driver.c"/>
        <file category="source" name="platform/drivers/src/edma/edma_hw_access.c"/>
        <file category="source" name="platform/drivers/src/edma/edma_irq.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="EIM"           Cversion="1.0.0" condition="S32K DRV_EIM">
      <description>EIM Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_EIM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__eim__drv.html"/>
        <file category="header" name="platform/drivers/inc/eim_driver.h"/>
        <file category="source" name="platform/drivers/src/eim/eim_driver.c"/>
        <file category="source" name="platform/drivers/src/eim/eim_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="ENET"          Cversion="1.0.0" condition="S32K148 DRV_ENET">
      <description>ENET Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_ENET
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__enet__driver.html"/>
        <file category="header" name="platform/drivers/inc/enet_driver.h"/>
        <file category="source" name="platform/drivers/src/enet/enet_driver.c"/>
        <file category="source" name="platform/drivers/src/enet/enet_hw_access.c"/>
        <file category="source" name="platform/drivers/src/enet/enet_irq.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="ERM"           Cversion="1.0.0" condition="S32K DRV_ERM">
      <description>ERM Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_ERM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__erm__driver.html"/>
        <file category="header" name="platform/drivers/inc/erm_driver.h"/>
        <file category="source" name="platform/drivers/src/erm/erm_driver.c"/>
        <file category="source" name="platform/drivers/src/erm/erm_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="EWM"           Cversion="1.0.0" condition="S32K DRV_EWM">
      <description>EWM Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_EWM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__ewm__drv.html"/>
        <file category="header" name="platform/drivers/inc/ewm_driver.h"/>
        <file category="source" name="platform/drivers/src/ewm/ewm_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="Flash"         Cversion="1.0.0" condition="S32K">
      <description>Flash Memory (Flash)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLASH
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__flash__driver.html"/>
        <file category="header" name="platform/drivers/inc/flash_driver.h"/>
        <file category="source" name="platform/drivers/src/flash/flash_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="Flash (MX25l6433F)" Cversion="1.0.0" condition="S32K DRV_FLASH_MX25">
      <description>Flash MX25l6433F Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLASH_MX25l6433F
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__flash__mx25l6433f__drv.html"/>
        <file category="header" name="platform/drivers/inc/flash_mx25l6433f_driver.h"/>
        <file category="source" name="platform/drivers/src/flash_mx25l6433f/flash_mx25l6433f_driver.c"/>
      </files>
    </component>
