saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.S32_SDK_DFP.1.2.0.pdsc
    <component Cclass="Device" Cgroup="SDK Driver" Csub="TRGMUX"        Cversion="1.0.0" condition="S32K DRV_TRGMUX">
      <description>TRGMUX Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_SAI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__trgmux__driver.html"/>
        <file category="header" name="platform/drivers/inc/trgmux_driver.h"/>
        <file category="source" name="platform/drivers/src/trgmux/trgmux_driver.c"/>
        <file category="source" name="platform/drivers/src/trgmux/trgmux_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="WDOG"          Cversion="1.0.0" condition="S32K DRV_WDOG">
      <description>WDOG Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_WDOG
      </RTE_Components_h>
      <files>
         <file category="doc"    name="doc/html/group__wdog__drv.html"/>
        <file category="header" name="platform/drivers/inc/wdog_driver.h"/>
        <file category="source" name="platform/drivers/src/wdog/wdog_driver.c"/>
        <file category="source" name="platform/drivers/src/wdog/wdog_hw_access.c"/>
      </files>
    </component>

    <!-- SDK OSA -->
    <component Cclass="Device" Cgroup="SDK OSIF" Csub="OSIF" Cvariant="Bare Metal" Cversion="1.0.0" condition="S32K OSIF_BM">
      <description>Bare Metal Abstraction Layer (no RTOS)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_OSIF_BM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__osif.html"/>
        <file category="header" name="rtos/osif/osif.h"/>
        <file category="source" name="rtos/osif/osif_baremetal.c"/>
      </files>
    </component>

    <bundle Cbundle="S32K144-EVB" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP S32K144-EVB Development Board</description>
      <doc>http://www.nxp.com/assets/documents/data/en/quick-start-guide/S32K144EVB-QSG.pdf</doc>
      <component Cgroup="LED"           Capiversion="1.0.0" condition="S32K144 DRV_CLOCK_PINS">
        <description>LED Interface for S32K144-EVB</description>
        <files>
          <file category="source" name="addon_mdk/Boards/NXP/S32K144-EVB/Common/LED_S32K144-EVB.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"       Capiversion="1.0.0" condition="S32K144 DRV_CLOCK_PINS">
        <description>Buttons Interface for S32K144-EVB</description>
        <files>
          <file category="source" name="addon_mdk/Boards/NXP/S32K144-EVB/Common/Buttons_S32K144-EVB.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="S32K144 DRV_CLOCK_PINS_ADC">
        <description>A/D Converter Interface for S32K144-EVB</description>
        <files>
          <file category="source" name="addon_mdk/Boards/NXP/S32K144-EVB/Common/ADC_S32K144-EVB.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="S32K148-EVB" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP S32K148-EVB Development Board</description>
      <doc></doc>
      <component Cgroup="LED"           Capiversion="1.0.0" condition="S32K148 DRV_CLOCK_PINS">
        <description>LED Interface for S32K148-EVB</description>
        <files>
          <file category="source" name="addon_mdk/Boards/NXP/S32K148-EVB/Common/LED_S32K148-EVB.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"       Capiversion="1.0.0" condition="S32K148 DRV_CLOCK_PINS">
        <description>Buttons Interface for S32K148-EVB</description>
        <files>
          <file category="source" name="addon_mdk/Boards/NXP/S32K148-EVB/Common/Buttons_S32K148-EVB.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="S32K148 DRV_CLOCK_PINS_ADC">
        <description>A/D Converter Interface for S32K148-EVB</description>
        <files>
          <file category="source" name="addon_mdk/Boards/NXP/S32K148-EVB/Common/ADC_S32K148-EVB.c"/>
        </files>
      </component>
    </bundle>

  </components>

  <boards>
    <board name="S32K144-EVB" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="S32K144UAT0xxxx"/>
      <!--compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="S32K14x"/-->
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="S32K144*"/>
      <image small="addon_mdk/Boards/NXP/S32K144-EVB/Documents/S32K144-EVB_small.png"
             large="addon_mdk/Boards/NXP/S32K144-EVB/Documents/S32K144-EVB_large.png"/>
      <description>
        The S32K144-EVB is a development board for the S32K144 32-bit ARM® Cortex™-M4 MCUs.
      </description>
      <book category="overview"  name="http://www.nxp.com/products/automotive-products/microcontrollers-and-processors/arm-mcus-and-mpus/s32-processors-microcontrollers/s32k144-evaluation-board:S32K144EVB" title="S32K144 Evaulation Board"/>
      <book category="setup"     name="http://www.nxp.com/assets/documents/data/en/quick-start-guide/S32K144EVB-QSG.pdf" title="Getting Started Guide"/>
      <book category="schematic" name="http://www.nxp.com/assets/downloads/data/en/schematics/S32K144EVB-SCH.pdf" title="S32K144EVB-Q100 Schematics"/>
      <book category="manual"    name="http://www.nxp.com/assets/downloads/data/en/board-support-packages/S32K144EVB-QSP.zip" title="S32K144EVB Quick Start Package"/>
      <feature type="ODbg"          n="1"              name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"           n="5"              name="USB Powered"/>
      <feature type="Button"        n="4"              name="Push-buttons: Reset, OpenSDA Reset, 2x User"/>
      <feature type="Button"        n="2"              name="2x capacitive touch"/>
      <feature type="LED"           n="1"              name="RGB LED"/>
      <feature type="Poti"          n="1"              name="Potentiometer for voltage and analog measurement"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="SDA 10 pin Cortex debug (0.05 inch connector)"/>
    </board>

    <board name="S32K148-EVB" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="S32K148UAxxxLQx"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="S32K148*"/>
      <description>
        The S32K148-EVB is a development board for the S32K148 32-bit ARM® Cortex™-M4 MCUs.
      </description>
    </board>

  </boards>

  <examples>
    <!-- S32K144-EVB FRDM Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="addon_mdk/Boards/NXP/S32K144-EVB/RTX5_Blinky/">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="S32K144-EVB" vendor="NXP" Dvendor="NXP:11" Dname="S32K144UAT0xxxx"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- S32K148-EVB FRDM Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="addon_mdk/Boards/NXP/S32K148-EVB/RTX5_Blinky/">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="S32K148-EVB" vendor="NXP" Dvendor="NXP:11" Dname="S32K148UAxxxLQx"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
